## Importar pandas

In [1]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [2]:
data = pd.read_csv('./titanic/train.csv')

## Primeiras Linhas

In [3]:
data.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

## Últimas Linhas

In [4]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Informações do DataFrame

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Resumo Estatístico de Campos Numéricos

In [6]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatístico de campos Categóricos

In [7]:
data.describe(include='O')

                        Name   Sex Ticket        Cabin Embarked
count                    891   891    891          204      889
unique                   891     2    681          147        3
top     Petroff, Mr. Nedelio  male   1601  C23 C25 C27        S
freq                       1   577      7            4      644

## Renomear colunas

In [8]:
data.rename({'Name': 'Nome', 'Sex': 'Sexo'}, axis=1, inplace=True)

In [9]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tafira', 'Cabine', 'Embarque']

In [11]:
data.head(2)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tafira,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

# Selecionar Colunas Específicas

In [12]:
data.columns
data[['Nome', 'Sexo', 'Classe', 'Sobreviveu']].head()

,Nome,Sexo,Classe,Sobreviveu
0,"Braund, Mr. Owen Harris",male,3,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,1
2,"Heikkinen, Miss. Laina",female,3,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,1
4,"Allen, Mr. William Henry",male,3,0

## Selecionando apenas uma coluna - Data Series

In [13]:
data['Idade']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Idade, Length: 891, dtype: float64

## Funções matemáticas embutidas

In [14]:
data['Idade'].mean() # Gera a média

29.69911764705882

In [15]:
data['Idade'].sum() # Soma todas as idades

21205.17

In [16]:
data['Idade'].count() # Retorna o número de registros

714

In [17]:
data['Idade'].median() # Média mediana

28.0

In [18]:
data['Idade'].mode() # Média moda (Valor que mais se repete)

0    24.0
dtype: float64

In [19]:
data['Idade'].max() # Retorna o mair valor no caso o mais valho

80.0

In [20]:
data['Idade'].min() # Retorna o menor valor no caso o mais jovem

0.42

In [21]:
data['Idade'].idxmin()  # Retorna o indice do menor valor no caso o indidice correspondente ao bebe com 0.42 de idade

803

In [22]:
data['Idade'].idxmax()  # Retorna o indice do maior valor encontrado no caso o indidice correspondente ao senhor  com 80 anos de idade

630

## Selecionando pelo Index - iloc

In [23]:
data.iloc[630] # Retorna os dados do id fornecido

IdPassageiro                                      631
Sobreviveu                                          1
Classe                                              1
Nome             Barkworth, Mr. Algernon Henry Wilson
Sexo                                             male
Idade                                            80.0
IrmaosConjuge                                       0
PaisFilhos                                          0
Bilhete                                         27042
Tafira                                           30.0
Cabine                                            A23
Embarque                                            S
Name: 630, dtype: object

In [24]:
data.iloc[[630, 803]] # Retorna os dados dos ids fornecidos

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tafira,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

In [25]:
data['Nome'].iloc[[630, 830]]

630       Barkworth, Mr. Algernon Henry Wilson
830    Yasbeck, Mrs. Antoni (Selini Alexander)
Name: Nome, dtype: object

## Operador de seleção "loc"

In [26]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].loc[data['Sexo'] == 'male'] # Seleciona os dados baseado em uma condição

     Idade  Sexo  Classe  Sobreviveu
0     22.0  male       3           0
4     35.0  male       3           0
5      NaN  male       3           0
6     54.0  male       1           0
7      2.0  male       3           0
..     ...   ...     ...         ...
883   28.0  male       2           0
884   25.0  male       3           0
886   27.0  male       2           0
889   26.0  male       1           1
890   32.0  male       3           0

[577 rows x 4 columns]

## Selecionando com múltiplas condições

In [27]:
data[['Idade', 'Sexo', 'Classe', 'Sobreviveu']].loc[(data['Idade'] >= 3 ) & (data['Idade'] <= 10) & (data['Sobreviveu'] == 1)]

     Idade    Sexo  Classe  Sobreviveu
10     4.0  female       3           1
43     3.0  female       2           1
58     5.0  female       2           1
165    9.0    male       3           1
184    4.0  female       3           1
193    3.0    male       2           1
233    5.0  female       3           1
237    8.0  female       2           1
261    3.0    male       3           1
348    3.0    male       3           1
407    3.0    male       2           1
445    4.0    male       1           1
448    5.0  female       3           1
489    9.0    male       3           1
535    7.0  female       2           1
549    8.0    male       2           1
618    4.0  female       2           1
691    4.0  female       3           1
720    6.0  female       2           1
750    4.0  female       2           1
751    6.0    male       3           1
777    5.0  female       3           1
869    4.0    male       3           1

## map e replace

In [28]:
data['Sexo'].map({'male': 'Homem', 'female': 'Mulher'})

0       Homem
1      Mulher
2      Mulher
3      Mulher
4       Homem
        ...
886     Homem
887    Mulher
888    Mulher
889     Homem
890     Homem
Name: Sexo, Length: 891, dtype: object

In [29]:
data['Sexo'].replace({'male': 'homem', 'female': 'mulher'})

0       homem
1      mulher
2      mulher
3      mulher
4       homem
        ...
886     homem
887    mulher
888    mulher
889     homem
890     homem
Name: Sexo, Length: 891, dtype: object

In [30]:
data['Sexo'].replace(['male', 'female'], ['homem', 'mulher'], inplace=True)

## Groupby - Agrupar por

In [31]:
data.groupby('Sobreviveu').mean()

,IdPassageiro,Classe,Idade,IrmaosConjuge,PaisFilhos,Tafira
Sobreviveu,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408

## Crosstab

In [32]:
pd.crosstab(data['Sobreviveu'], data['Classe'], margins=True) #.style.background_gradient(cmap='OrRd')

Classe        1    2    3  All
Sobreviveu
0            80   97  372  549
1           136   87  119  342
All         216  184  491  891

## Ordenando Dados

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

## Deletando Coluna ou Linha

## Apply e Lambda

## Variáveis Dummy | HotEncoder

## Concatenando DataFrames

# Expressões Regulares

.  - qualquer caracter
<br>\d - dígitos (0-9)
<br>\D - exceto dígitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaço em branco (tab, espaço, nova linha)
<br>\S - qualquer coisa exceto espaço em branco (tab, espaço, nova linha)
<br>\b - início de uma palavra
<br>\B - exceto início da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres não em colchetes
<br>| - ou
<br>( ) - grupo

<br>* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - número exato
<br>{3,4} - range de Números (mínimo, máximo)

Referência (inglês): 
http://bit.ly/ExpressoesRegulares

# Engenharia de Recursos - Feature Engineering

## Mudando Valores Linha Por Linha - iterrows()